In [12]:
import pandas as pd
import numpy as np

In [4]:
my_series = pd.Series([4,7,-5,3,-1])

In [7]:
my_series[1]

7

In [9]:
my_series[1:3]

1    7
2   -5
dtype: int64

In [10]:
my_series[my_series>2]

0    4
1    7
3    3
dtype: int64

In [11]:
my_series*2

0     8
1    14
2   -10
3     6
4    -2
dtype: int64

In [13]:
np.exp(my_series)

0      54.598150
1    1096.633158
2       0.006738
3      20.085537
4       0.367879
dtype: float64

In [14]:
np.sum(my_series)

8

In [25]:
df = pd.DataFrame({
    'name': ['Маша', 'Вася', 'Эдуард'],
    'age': [25, 8, 48],
    'job': ['Программист', 'Школьник', 'Большой босс'],
    'salary': [100, 10, 200]
}, index = ['some', 'random', 'words'])

In [26]:
df

          name  age           job  salary
some      Маша   25   Программист     100
random    Вася    8      Школьник      10
words   Эдуард   48  Большой босс     200

In [27]:
name = df['name']

In [28]:
name

some        Маша
random      Вася
words     Эдуард
Name: name, dtype: object

In [31]:
df[df['salary']>500]

         name  age           job  salary
some     Маша   25   Программист    1000
words  Эдуард   48  Большой босс    2000

In [29]:
df['salary'] *= 10
df

          name  age           job  salary
some      Маша   25   Программист    1000
random    Вася    8      Школьник     100
words   Эдуард   48  Большой босс    2000

In [32]:
df.iloc[1]

name          Вася
age              8
job       Школьник
salary         100
Name: random, dtype: object

In [33]:
df.T

               some    random         words
name           Маша      Вася        Эдуард
age              25         8            48
job     Программист  Школьник  Большой босс
salary         1000       100          2000